tap "dagger/tap"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mongodb/brew"
tap "oven-sh/bun"
tap "stefanlogue/tools"
tap "stripe/stripe-cli"
brew "aws-cdk"
brew "aws-sam-cli"
brew "awscli"
brew "bandwhich"
brew "caddy"
brew "cocoapods"
brew "csvlens"
brew "deno"
brew "esbuild"
brew "flyctl"
brew "fzf"
brew "gh"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "graphviz"
brew "gum"
brew "helm"
brew "jq"
brew "krew"
brew "kubeconform"
brew "kubescape"
brew "libopusenc"
brew "luarocks"
brew "minikube"
brew "mongosh"
brew "neovim"
brew "nvm"
brew "pinentry-mac"
brew "pkgconf"
brew "pnpm"
brew "poetry"
brew "prettier"
brew "repomix"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "rustup"
brew "serve"
brew "sherlock"
brew "sloc"
brew "starship"
brew "stockfish"
brew "tailscale"
brew "terraform"
brew "tree"
brew "trivy"
brew "wails"
brew "wget"
brew "yamlfmt"
brew "yarn"
brew "stripe/stripe-cli/stripe"
cask "brave-browser"
cask "dbeaver-community"
cask "discord"
cask "figma"
cask "firefox"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "google-drive"
cask "imageoptim"
cask "iterm2"
cask "lens"
cask "mongodb-compass"
cask "monitorcontrol"
cask "notion"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "setapp"
cask "slack"
cask "steam"
cask "table-tool"
cask "vlc"
cask "zoom"
