# Taps
tap "bartolli/codanna"
tap "clojure/tools"
tap "codecrafters-io/tap"
tap "dagger/tap"
tap "derailed/k9s"
# homebrew/bundle and homebrew/services are now built-in
tap "josephgoksu/tap"
tap "mongodb/brew"
tap "opencode-ai/tap"
tap "oven-sh/bun"
tap "stefanlogue/tools"
tap "steipete/tap"
tap "stripe/stripe-cli"

# Core CLI tools
brew "act"
brew "ast-grep"
brew "awscli"
brew "aws-cdk"
brew "aws-sam-cli"
brew "aws-sso-cli"
brew "aws-vault"
brew "bandwhich"
brew "biome"
brew "caddy"
brew "chamber"
brew "cloudflared"
brew "cocoapods"
brew "csvlens"
brew "dagger"
brew "deno"
brew "direnv"
brew "doctl"
brew "e1s"
brew "esbuild"
brew "fd"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-extras"
brew "gitleaks"
brew "glances"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "go-task"
brew "golangci-lint"
brew "goreleaser"
brew "graphviz"
brew "gum"
brew "helm"
brew "htop"
brew "jq"
brew "k6"
brew "krew"
brew "kubeconform"
brew "kubescape"
brew "libimobiledevice"
brew "libopusenc"
brew "luarocks"
brew "minikube"
brew "mole"
brew "mongosh"
brew "neovim"
brew "nvm"
brew "ollama"
brew "opencode"
brew "openjdk"
brew "pinentry-mac"
brew "pkgconf"
brew "pnpm"
brew "poetry"
brew "prettier"
brew "protobuf"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "repomix"
brew "ripgrep"
brew "rsync"
brew "rustup"
brew "serve"
brew "shellcheck"
brew "specify"
brew "starship"
brew "stockfish"
brew "tailscale"
brew "opentofu"
brew "tmux"
brew "tokei"
brew "tree"
brew "trivy"
brew "upx"
brew "wails"
brew "wget"
brew "witr"
# wrangler deprecated - use npx wrangler instead
brew "xcodegen"
brew "yamlfmt"
brew "yamllint"
brew "yarn"
brew "yq"
brew "yt-dlp"
brew "zsh"
# zsh plugins installed via git clone in install.sh

# Formulae from custom taps
brew "bartolli/codanna/codanna"
brew "clojure/tools/clojure"
brew "codecrafters-io/tap/codecrafters"
brew "derailed/k9s/k9s"
brew "josephgoksu/tap/taskwing"
brew "mongodb/brew/mongodb-community"
brew "oven-sh/bun/bun"
brew "stripe/stripe-cli/stripe"

# GUI Applications
cask "antigravity"
cask "balenaetcher"
cask "beekeeper-studio"
cask "bitwarden"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "codex"
cask "codexbar"
cask "dbeaver-community"
cask "discord"
cask "figma"
cask "firefox"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "google-drive"
cask "imageoptim"
cask "insomnia"
cask "lens"
cask "meteor"
cask "mongodb-compass"
cask "monitorcontrol"
cask "notion"
cask "nvidia-geforce-now"
cask "raycast"
cask "rectangle"
cask "setapp"
cask "slack"
cask "table-tool"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zed"
cask "zoom"
