tap "codecrafters-io/tap"
tap "dagger/tap"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mongodb/brew"
tap "oven-sh/bun"
tap "stefanlogue/tools"
tap "stripe/stripe-cli"
brew "aws-cdk"
brew "aws-sam-cli"
brew "awscli"
brew "bandwhich"
brew "caddy"
brew "cocoapods"
brew "csvlens"
brew "deno"
brew "esbuild"
brew "flyctl"
brew "fzf"
brew "gh"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "graphviz"
brew "gum"
brew "helm"
brew "jq"
brew "krew"
brew "kubeconform"
brew "kubescape"
brew "libopusenc"
brew "luarocks"
brew "minikube"
brew "mongosh"
brew "neovim"
brew "nvm"
brew "pinentry-mac"
brew "pkgconf"
brew "pnpm"
brew "poetry"
brew "prettier"
brew "repomix"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "rustup"
brew "serve"
brew "sherlock"
brew "sloc"
brew "starship"
brew "stockfish"
brew "tailscale"
brew "terraform"
brew "tree"
brew "trivy"
brew "wails"
brew "wget"
brew "yamlfmt"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "codecrafters-io/tap/codecrafters"
brew "dagger/tap/dagger"
brew "mongodb/brew/mongodb-community"
brew "oven-sh/bun/bun"
brew "stefanlogue/tools/meteor"
brew "stripe/stripe-cli/stripe"
cask "alacritty"
cask "arduino-ide"
cask "balenaetcher"
cask "brave-browser"
cask "cursor"
cask "dbeaver-community"
cask "discord"
cask "figma"
cask "firefox"
cask "ghostty"
cask "gimp"
cask "google-chrome"
cask "google-drive"
cask "imageoptim"
cask "iterm2"
cask "lens"
cask "mongodb-compass"
cask "monitorcontrol"
cask "nordic-nrf-command-line-tools"
cask "notion"
cask "nvidia-geforce-now"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "setapp"
cask "skype"
cask "slack"
cask "steam"
cask "table-tool"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "windsurf"
cask "zoom"
vscode "adamhartford.vscode-base64"
vscode "akamud.vscode-theme-onedark"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "arturock.gitstash"
vscode "austenc.tailwind-docs"
vscode "azemoh.one-monokai"
vscode "betterthantomorrow.calva"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "continue.continue"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dendron.dendron"
vscode "dendron.dendron-paste-image"
vscode "denoland.vscode-deno"
vscode "djblue.portal"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-diff"
vscode "fill-labs.dependi"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.mermaid-export"
vscode "huizhou.githd"
vscode "jock.svg"
vscode "kevinrose.vsc-python-indent"
vscode "khaeransori.json2csv"
vscode "kkenya.mermaid-sequence-number"
vscode "mads-hartmann.bash-ide-vscode"
vscode "maximus136.change-string-case"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "naumovs.color-highlight"
vscode "pflannery.vscode-versionlens"
vscode "prisma.prisma"
vscode "pwabuilder.pwa-studio"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "riazxrazor.html-to-jsx"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "wakatime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "yinfei.luahelper"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
