amazonwebservices.aws-toolkit-vscode
anthropic.claude-code
arturock.gitstash
austenc.tailwind-docs
bierner.markdown-mermaid
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
codezombiech.gitignore
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
docker.docker
donjayamanne.githistory
editorconfig.editorconfig
esbenp.prettier-vscode
fabiospampinato.vscode-diff
fill-labs.dependi
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
foxundermoon.shell-format
github.copilot
github.copilot-chat
github.vscode-github-actions
golang.go
huizhou.githd
jock.svg
kevinrose.vsc-python-indent
khaeransori.json2csv
mads-hartmann.bash-ide-vscode
maximus136.change-string-case
mechatroner.rainbow-csv
mgmcdermott.vscode-language-babel
mikestead.dotenv
mindaro-dev.file-downloader
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.makefile-tools
ms-vscode.vscode-typescript-next
naumovs.color-highlight
pflannery.vscode-versionlens
quicktype.quicktype
redhat.vscode-yaml
riazxrazor.html-to-jsx
rvest.vs-code-prettier-eslint
tamasfe.even-better-toml
timonwong.shellcheck
tyriar.sort-lines
unifiedjs.vscode-mdx
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
yinfei.luahelper
yoavbls.pretty-ts-errors
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
